[TRzTabSheet]
;frmMain
tsAppDemo.Caption=Application
tsBaseManage.Caption=Base manage
tsKeypadManage.Caption=Keypad manage
tsConnectBase.Caption=Base connection

tsSign.Caption=Signin
tsPressSign.Caption=Key signin(CRS)
tsLoginSign.Caption=Login signin
tsChoice.Caption=Choice
tsJudge.Caption=Judge
tsSequence.Caption=Sequence
tsNumber.Caption=Number
tsCloze.Caption=Cloze
tsRushAnswer.Caption=RushAnswer
tsHardwareMonitor.Caption=Hardware monitor
tsHardwareTest.Caption=Hardware test
tsExamination.Caption=Examination
tsHomework.Caption=Homework
tsSelfExercise.Caption=Self exercise
tsRequest.Caption=Request
tsMessage.Caption=Message

tsVote.Caption=Vote
tsEvaluation.Caption=Evaluation
tsScore.Caption=Score
tsBatchVote.Caption=Batch vote
tsBatchEvaluation.Caption=Batch evaluation
tsBatchScore.Caption=Batch score
tsMultipleAssess.Caption=Multiple assess
tsElection.Caption=Election
tsWordStock.Caption=WordStock
tsEvaluationRuleExplain.Caption=Evaluation rule explain
tsScoreRuleExplain.Caption=Score rule explain

tsFileDownload.Caption=File download
tsAvoidItemsDownload.Caption=Avoid items download
tsDeskBrand.Caption=Desk brand
tsDeskTimer.Caption=Time
tsDeskScore.Caption=Score
tsDataCapture.Caption=Data capture
tsRelay.Caption=Mobile base

tsBaseSet.Caption=Base config
tsVoteSysIdent.Caption=Voting system features
tsBaseSoftDog.Caption=Base station software dog set
tsBaseOther.Caption=The others
tsTcpIp.Caption=TCP/IP
tsBaseAddSet.Caption=Base add config
tsBaseMulChannel.Caption=Base mulchannel
tsEnabledMobileBase.Caption=Enabled mobile base
tsMobileBaseManage.Caption=Mobile base manage

tsKeyConfig.Caption=Keypad config
tsKeyStudentID.Caption=Student id
tsKeyStudentName.Caption=Student name
tsKeyOther.Caption=The others
tsKeyMatchIDChannel.Caption=MatchCode+id+channel

tsLamp.Caption=Lamp control
tsLampGroup.Caption=Lamp group control

[TRzBitBtn]
btnDownloadData.Caption=Download data
btnCountData.Caption=Statistics
btnClear.Caption=Clear
btnHelp.Caption=Help
btnAbout.Caption=About

[TButton]
;frmMain
btnStart.Caption=Start
btnStop.Caption=Stop

btnExitBackgroupSignIn.Caption=Exit backgroup singin
btnAuthorizesuccess.Caption=Authorize success
btnAuthorizeError.Caption=Authorize error
btnAuthorizeExit.Caption=Exit authorize

btnLoginSetDynamicID.Caption=Set id
btnLoginAuthorize.Caption=Authorize
btnSignAuthorizeBySN.Caption=Authorize

btnNumberShowResult.Caption=Show result

btnGetExamResult.Caption=Get exam result
btnGetExamResults.Caption=Get exam results
btnExitExamResults.Caption=Exit to get 
btnQuitExam.Caption=quit exam

btnGetHomeworkResult.Caption=Get homework result

btnVoteShowResult.Caption=Show result

btnGradeShowResult.Caption=Show result

btnScoreShowResult.Caption=Show result
btnCleanKeyScoreRecord.Caption=Clean score record

btnSetRelay.Caption=Set mobile base

btnSetRelay.Caption=SetRelay

btnConnectBase.Caption=Connect
btnCloseBase.Caption=Disconnect
btnReadBaseSet.Caption=Get
btnWriteBaseSet.Caption=Set
btnReadVoteSysIdent.Caption=Get
btnWriteVoteSysIdent.Caption=Set
btnReadSoftDog.Caption=Get
btnWriteSoftDog.Caption=Set
btnEnterMate.Caption=Start match
btnExitMate.Caption=Stop match
btnReadBaseHInfo.Caption=Read hardware message
btnReadBaseMatchCode.Caption=Read matching code
btnEnterEstimateChannel.Caption=Enter channel analysis
btnExitEstimateChannel.Caption=Quit channel analysis

btnGetBaseIPAddress.Caption=Get IP address
btnSetBaseIPAddress.Caption=Set IP address
btnGetBaseMACAddress.Caption=Get MAC address
btnSetBaseMACAddress.Caption=Set MAC address
btnGetAddConfig.Caption=Get add config
btnSetAddConfig.Caption=Set add config
btnGetMultichannel.Caption=Get multi channel
btnSetMultichannel.Caption=Set multi channel

btnGetEnabledMobileBase.Caption=Get enabled mobile base
btnSetEnabledMobileBase.Caption=Set enabled mobile base

btnReadKeypadSet.Caption=Get
btnWriteKeypadSet.Caption=Set

btnGetStudentID.Caption=Get
btnSetStudentID.Caption=Set

btnGetStudentName.Caption=Get
btnSetStudentName.Caption=Set

btnStartKeyChannelTest.Caption=Start communication test
btnStopKeyChannelTest.Caption=Stop communication test
btnReadKeyHInfo.Caption=Read hardware message
btnCloseKeypad.Caption=Turn off keypad
btnShowKeyInfo.Caption=Show keypad's message 

btnRemoteOffRange.Caption=Specify the scope of Turn off keypad

btnSetMatchIDChannel.Caption=Write MatchCode+ID+Channel

btnDataCaptureReset.Caption=Reset data capture
btnSetDirectTransfer.Caption=Set direct transfer
btnSetTimeTransfer.Caption=Set time transfer
btnStopTimeTransfer.Caption=Stop time transfer

btnLampGetConfig.Caption=Get lamp config
btnLampSetConfig.Caption=Set lamp config
btnLampSwitch.Caption=Lamp switch
btnLampSwitchConfig.Caption=Lamp switch config
btnLampSyncKey0.Caption=Cancel lamp sync key
btnLampSyncKey1.Caption=Uses lamp sync key
btnLampSwitchZone.Caption=Lamp switch zone
btnLampSwitchZonesOn.Caption=Lamp switch zone on
btnLampSwitchZonesOff.Caption=Lamp switch zone off

btnDeskExitTime.Caption=Exit time
btnDeskTime.Caption=Start time
btnDeskCountdown.Caption=Start countdown
btnDeskPauseTime.Caption=Pause time
btnDeskContinueTime.Caption=Continue time
btnDeskShowTime.Caption=Static display
btnDeskSetManualTime.Caption=Set manually time
btnDeskSetManualCountdown.Caption=Set manually countdown
btnDeskForbitManualTime.Caption=Forbit manual time
btnDeskSetScore.Caption=Show score

btnClearRespones.Caption=Clear respones
btnStopDownload.Caption=Stop download
btnStartDownload.Caption=Start download

btnSetCmdDelay.Caption=Set cmd delay

[TLabel]
;frmMain
lblBaseId.Caption=Base station ID
lblConnectType.Caption=Connection type
lblConnectBaseID.Caption=Connect the base station ID
lblNewBaseId.Caption=New base station ID
lblChannel.Caption=Channel
lblStartKeypad.Caption=Keypad from
lblEndKeypad.Caption=Keypad to
lblRFPower.Caption=RF grade
lblAuthCode.Caption=Authorized code
lblLoginMode.Caption=Login mode
lblKeyReportMode.Caption=Keypad report mode
lblBuzzerMode.Caption=Buzz mode
lblBackLightMode.Caption=LCD background mode
lblKeyOffTime.Caption=Keypad turn off time
lblSubmitMode.Caption=Submission mode
lblPassword.Caption=Users password
lblUserPart1.Caption=Customized message 1
lblUserPart2.Caption=Customized message 2
lblMin.Caption=minute

lblBaseIPAddress.Caption=IP address
lblBaseMACAddress.Caption=MAC address

lblBaseMatchMode.Caption=Match mode
lblBaseName.Caption=Base name

lblEnabledRelay.Caption=Enabled mobile base
lblEnabledKeypadApplyRelay.Caption=Enabled keypad apply
lblChannelNumber.Caption=Channel number
lblChannel1.Caption=Channel1
lblChannel2.Caption=Channel2
lblChannel3.Caption=Channel3
lblChannel4.Caption=Channel4

lblEnabledMobileBase.Caption=Enabled mobile base

lblKeypadId.Caption=Keypad id
lblCloseTime.Caption=Automatic turn off time
lblMinute.Caption=minute
lblKeyMatchMode.Caption=Match mode

lblKeyStudentID.Caption=Student id
lblKeyStudentName.Caption=Student name

lblOffKeyMin.Caption=Keypad id min
lblOffKeyMax.Caption=Keypad id max

lblKeyMatchCode.Caption=Keypad new match code
lblKeyMatchCodeNull.Caption=Empty don't modify
lblKeyZoneMode.Caption=Modify zone
lblKeyIDZone.Caption=Keypad id zone
lblKeySN.Caption=Keypad sn
lblKeyChan.Caption=Keypad channel
lblKeyChanZero.Caption=Zero don't modify
lblKeyIDPlus.Caption=Keypad id plus
lblKeyIDValue.Caption=Keypad id change

lblConnectType.Caption=Connect type
lblConnnectBaseID.Caption=Base id
lblConnectBaseIP.Caption=Base ip

lblBaseIP.Caption=Base ip
lblBaseCmdDelay.Caption=Base cmd delay(ms)
lblKeyCmdDelay.Caption=Keypad cmd delay(ms)
lblDownloadCmdDelay.Caption=Down cmd delay(ms)
lblUploadCmdDelay.Caption=Upload cmd delay(ms)

lblStartMode.Caption=Start mode
lblBaseDemoKeyIDs.Caption=The demo Keypad id
lblDemoMode.Caption=Demo mode is closed

lblSignModel.Caption=Signin model
lblSignCode.Caption=Signin code
lblSignKeyID.Caption=Keypad id

lblLSLoginMode.Caption=Login mode
lblLSCodeMode.Caption=Code mode
lblLSAuthorizeMode.Caption=Authorize mode
lblLSKeyID.Caption=Keypad id
lblLSLoginState.Caption=Login state
lblLCKeyID.Caption=Keypad id
lblLSSignKeySN.Caption=Keypad sn

lblLSLoginMode.Caption=Login Mode
lblLSCodeMode.Caption=Code Mode
lblLSAuthorizeMode.Caption=Authorize Mode
lblLSKeyID.Caption=Keypad id
lblLCKeyID.Caption=Keypad id
lblLSLoginState.Caption=Login State

lblChoiceShowModel.Caption=Type of option number
lblChoiceModifyModel.Caption=Modify mode
lblChoiceSecrecyModel.Caption=Secrecy mode
lblChoiceSubmitModel.Caption=Forced submission mode
lblChoiceOptions.Caption=Option numbers
lblChoices.Caption=Selectable numbers
lblChoicePromptMode.Caption=Answer prompt mode
lblChoiceAnswer.Caption=Correct answer(ABCD...)

lblTrueFalseMode.Caption=Vote mode
lblTrueFalseModifyMode.Caption=Modify mode
lblTrueFalseSecrecyMode.Caption=Secrecy mode
lblTrueFalsePromptMode.Caption=Answer prompt mode
lblTrueFalseAnswer.Caption=Correct answer(123)

lblOrderShowModel.Caption=Type of option number
lblOrderModifyModel.Caption=Modify mode
lblOrderSecrecyModel.Caption=Secrecy mode
lblOrderSubmitModel.Caption=Forced submission mode
lblOrderOptions.Caption=Option number
lblOrderChoices.Caption=Selectable numbers
lblOrderPromptMode.Caption=Answer prompt mode
lblOrderAnswer.Caption=Correct answer(ABCD...)

lblNumberMode.Caption=Number mode
lblNumberSecrecyModel.Caption=Modify mode
lblNumberModifyModel.Caption=Secrecy mode
lblNumberMin.Caption=Min
lblNumberMax.Caption=Max
lblNumberDecimal.Caption=Decimal
lblNumberPromptMode.Caption=Answer prompt mode
lblNumberAnswer.Caption=Correct answer
lblNumberShowResult.Caption=Result

lblClozeType.Caption=Cloze type
lblClozeModifyModel.Caption=Modify mode
lblClozeSecrecyModel.Caption=Secrecy mode
lblClozeMaxLength.Caption=Max length
lblClozePromptMode.Caption=Answer prompt mode
lblClozeAnswer.Caption=Correct answer

lblRushAnswerMode.Caption=Answer mode
lblRushAnswerInfo.Caption=To press the appointed key for  the quick response, if needing to submit the answer directly, please use the sign choice function.

lblKeyMonitorEnabled.Caption=After "start", the state of receiving keypads will cause the events of keyStatus, otherwise will not. It doesn't need to start and stop.

lblAnalogModel.Caption=Simulation mode
lblAnalogFirstSubmitTime.Caption=The time of first pressing
lblAnalogIntervalSubmitTime.Caption=The alternation time of pressing

lblExamMode.Caption=Exam mode
lblExamNum.Caption=Exam numble
lblExamReportRate.Caption=Report rate
lblExamName.Caption=Exam name
lblExamResultKeyID.Caption=Keypad id
lblExamResultKeyIDs.Caption=Keypad ids

lblHWSubmitMode.Caption=Submit mode
lblHWName.Caption=Homework name
lblHWID.Caption=Homework id
lblHwGetResultKeyID.Caption=Keypad id

lblSEDownKeyID.Caption=Download Keypad id
lblSEID.Caption=Exercise id
lblSEName.Caption=Exercise name

lblRequest.Caption=After "Start", the state of receiving keypads request will cause the events of KeyStatus, otherswise will not. It doesn't need to start and stop.

lblSendMsg.Caption=Send msg
lblSendMsgKeyID.Caption=Send keypad id
lblReceiveMsg.Caption=Receive
lblReceiveMsgKeyID.Caption=Receive keypad id

lblSingleGradeModel.Caption=Grade mode
lblSingleGradeModifyModel.Caption=Modify mode
lblSingleGradeSecrecyModel.Caption=Secrecy mode
lblSingleGradeRules.Caption=Grade rule
lblSingleGradeMinScore.Caption=Min
lblSingleGradeMaxScore.Caption=Max

lblVoteMode.Caption=Vote mode
lblVoteModifyMode.Caption=Modify mode
lblVoteSecrecyMode.Caption=Secrecy mode
lblTitleVoteMode.Caption=Title vote mode
lblVoteTitle.Caption=Vote title
lblVoteResult.Caption=Passed stata,Nokey,Yes,No,Abstain

lblGradeMode.Caption=Grade mode
lblGradeModifyMode.Caption=Modify mode
lblGradeSecrecyMode.Caption=Secrecy mode
lblGradeNumerical.Caption=Level
lblGradeCustomRule.Caption=Custom rule
lblGradeResultInfo.Caption=Nokey,Level1,Level2,Level3,...,Leveln

lblScoreMode.Caption=Score mode
lblScoreSecrecyMode.Caption=Secrecy mode
lblScoreModifyMode.Caption=Modify mode
lblScoreDefault.Caption=Default
lblScoreMin.Caption=Min
lblScoreMax.Caption=Max
lblScoreDecimal.Caption=Decimal
lblScorePromptMode.Caption=Prompt mode
lblScoreAnswer.Caption=Correct answer
lblScoreTitel.Caption=Score title
lblScoreID.Caption=Score id
lblScoreLessMode.Caption=Less mode
lblScoreItemNumber.Caption=Item number
lblScoreResultInfo.Caption=Result
lblScoreCleanRecordKeyID.Caption=Clean record keypad id

lblBatchVoteNumBegin.Caption=Begin number
lblBatchVoteNumEnd.Caption=End number
lblBatchVoteMode.Caption=Batch mode
lblBatchVoteSecrecyMode.Caption=Secrecy mode
lblBatchVoteLessMode.Caption=Less mode
lblBatchVoteFixBallotMode.Caption=Fix ballot mode
lblBatchVoteModifyMode.Caption=Modify mode
lblBatchVoteAvoidMode.Caption=Avoid mode
lblBatchVoteBallots.Caption=Balltos

lblBatchGradeNumBegin.Caption=Begin number
lblBatchGradeNumEnd.Caption=End number
lblBatchGradeMode.Caption=Batch mode
lblBatchGradeSecrecyMode.Caption=Secrecy mode
lblBatchGradeLessMode.Caption=Less mode
lblBatchGradeFixBallotMode.Caption=Fix ballot mode
lblBatchGradeModifyMode.Caption=Modify mode
lblBatchGradeAvoidMode.Caption=Avoid mode
lblBatchGradeBallots.Caption=Balltos

lblBatchScoreNumBegin.Caption=Begin number
lblBatchScoreNumEnd.Caption=End number
lblBatchScoreMode.Caption=Batch mode
lblBatchScoreSecrecyMode.Caption=Secrecy mode
lblBatchScoreLessMode.Caption=Less mode
lblBatchScoreModifyMode.Caption=Modify mode
lblBatchScoreAvoidMode.Caption=Avoid mode

lblMulAssessMode.Caption=Assess mode
lblMulAssessDisplayFormat.Caption=Display format
lblMulAssessNumBegin.Caption=Begin number
lblMulAssessNumEnd.Caption=End number
lblMulAssessRuleBegin.Caption=Begin rule
lblMulAssessRuleEnd.Caption=End rule
lblMulAssessColWidthFirst.Caption=First col width
lblMulAssessColWidthOther.Caption=Other col width
lblMulAssessEnterMove.Caption=Enter move
lblMulAssessLessMode.Caption=Less mode
lblMulAssessSecrecyMode.Caption=Secrecy mode
lblMulAssessModifyMode.Caption=Modify mode
lblMulAssessAvoidMode.Caption=Avoid mode

lblElectionUIMode.Caption=UI mode
lblElectionMode.Caption=Election mode
lblElectionSelects.Caption=Selects
lblElectionOthersMode.Caption=Others mode
lblElectionLessMode.Caption=Less mode
lblElcItemStartID.Caption=Start id
lblElectionSecrecyMode.Caption=Secrecy mode
lblElcItemEndID.Caption=End id
lblElectionModifyMode.Caption=Modify mode

lblWordKeypadMode.Caption=Keypad mode

lblRelayMode.Caption=Mode
lblRelayID.Caption=ID
lblRelaySwitch.Caption=Switch
lblRelayTransferMode.Caption=Transfer mode
lblRelayTransferDelayLevel.Caption=Transfer delay level
lblRelayDestAddrMode.Caption=Destination address mode
lblRelayDestAddrGroupID.Caption=Destination address Group ID
lblRelayDestAddr.Caption=Destination address

lblDataCaptureID.Caption=Capture id
lblDataCaptureInterval.Caption=Interval

lblDeskID.Caption=Desk id
lblLampShowMode.Caption=Show mode
lblLampSwitch.Caption=Switch
lblKeyLamps.Caption=One lamp Channels
lblLampZone.Caption=Zone
lblLampZoneTip.Caption=Zone id start from 0,0 Zone Control 0-128 channels
lblLampSwitchZones.Caption=Zones

lblDeskTimeShowMode.Caption=Show mode
lblDeskTimeShowFormat.Caption=Show format
lblDeskTimeLimit.Caption=Time limit
lblDeskTimeLimitSecond.Caption=Second
lblDeskScoreMode.Caption=Score mode
lblDeskScoreShowMode.Caption=Show mode
lblDeskScoreFlashLED.Caption=Flash effect
lblDeskScoreLED1.Caption=Green lamp
lblScoreControlLED2.Caption=Red lamp
lblDeskScore.Caption=Score

lblBaseIPAddress.Caption=IP address
lblBaseMACAddress.Caption=MAC address

lblKeyMatchCode.Caption=New MatchCode
lblKeyMatchCodeNull.Caption=Empty not modify
lblKeyZoneMode.Caption=Modify range
lblKeyIDZone.Caption=Keypad numbers range
lblKeySN.Caption=Keypad SN
lblKeyChan.Caption=Keypad Channel
lblKeyIDPlus.Caption=Modify keypad numbers mode
lblKeyIDValue.Caption=keypad numbers change value
lblKeyChanZero.Caption=Zero not modify

lblDemoMode.Caption=Demo mode has been closed

lblDownloadKeyId.Caption=Download keypad id
lblShowResultKey.Caption=Show result keypad id

lblProtocolType.Caption=Protocol type

;frmKeypadResponse
lblKeyScope.Caption=Keypad range
lblSelectKey.Caption=Selecting keypads
lblResponseNumber.Caption=Response number

;frmAbout
lblTitle.Caption=SunVote SDK Test Tool
lblVersion.Caption=Version:
lblSales.Caption=Sales Tel:
lblSalesValue.Caption=+86-731-85123999
lblSupport.Caption=Support Tel:
lblSupportValue.Caption=+86-18908457700
lblWeb.Caption=Website:
lblCopyright.Caption=Copyright:
lblCopyrightValue.Caption=SunSky Corporation. All Rights Reserved

[TCheckBox]
;frmMain
chkMonitor.Caption=Monitoring data
chkFreeScanBase.Caption=Read data in idle time
chkBaseDemoMode.Caption=Enable the demo mode
chkKeyMonitorEnabled.Caption=Enable the hardware monitor
chkRequest.Caption=Enable the keypad request
chkBackgroudSignIn.Caption=Backgroud signin

chkAllDesk.Caption=All desk
chkLampAllOn.Caption=All on
chkLampZoneAllOn.Caption=All on
chkAllDataCaptureID.Caption=All data capture id

[TComboBox]
;frmMain
cbbRFPower.Items=0-press defaul value\r\n1-full power\r\n2-middle power\r\n3-small power
cbbLoginMode.Items=0-single key\r\n1-sign code\r\n2-input id\r\n3-input name\r\n4-auto id\r\n5-auto name
cbbKeyReportMode.Items=0-not report\r\n1-report in stand by\r\n2-report in voting\r\n3-report in stand by and voting
cbbBuzzerMode.Items=0-turn off\r\n1-turn on
cbbBackLightMode.Items=0-turn off the background light\r\n1-press the keypad to delay the turn off time\r\n2-submit successfully to delay the light going out\r\n3-continuously light
cbbSubmitMode.Items=0-press the submission key to submit\r\n1-delay the automatic submission 
cbbBaseMatchMode.Items=1-fixed matching\r\n2-dynamic matching\r\n3-free matching
cbbEnabledRelay.Items=0-disenabled\r\n1-enabled
cbbEnabledKeypadApplyRelay.Items=0-disenabled\r\n1-enabled

cbbEnabledMobileBase.Items=0-disenabled\r\n1-enabled

cbbKeyMatchMode.Items=1-fixed matching\r\n2-dynamic matching
cbbKeyZoneMode.Items=0-do not use the specified range (all change)\r\n1-according to the range changes\r\n2-specifies the hardware serial number
cbbKeyIDPlus.Items=0-not change keyboard id\r\n1-keyboard id unified add one value\r\n2-the keyboard id unified value minus 1\r\n3-specify the SN change into a new number

cbbStartMode.Items=0-continue\r\n1-clean and start again\r\n2-submit again and continue to start

cbbSignModel.Items=0-single key\r\n1-sign code

cbbLoginCodeMode.Items=0-auto\r\n1-manual
cbbLoginAuthorizeMode.Items=0-auto\r\n1-manual
cbbLoginState.Items=1-login success\r\n2-failure,imput again\r\n3-failure,not allowed

cbbChoiceShowModel.Items=0-display letters\r\n1-display number
cbbChoiceModifyModel.Items=0-not allow the modify\r\n1-allow the modify 
cbbChoiceSecrecyModel.Items=0-not keep secret\r\n1-keep secret
cbbChoiceSubmitModel.Items=0-allow the missing vote\r\n1-not allow the missing vote
cbbChoicePromptMode.Items=0-without prompt\r\n1-only correct or wrong\r\n2-correct or wrong & answer

cbbTrueFalseMode.Items=1-True/False\r\n2-Yes/No\r\n3-Yes/No/Abstain
cbbTrueFalseModifyMode.Items=0-not allow the modify\r\n1-allow the modify
cbbTrueFalseSecrecyMode.Items=0-not keep secret\r\n1-keep secret
cbbTrueFalsePromptMode.Items=0-without prompt\r\n1-only correct or wrong\r\n2-correct or wrong & answer

cbbOrderShowModel.Items=0-display letters\r\n1-display number
cbbOrderModifyModel.Items=0-not allow the modify\r\n1-allow the modify
cbbOrderSecrecyModel.Items=0-not keep secret\r\n1-keep secret
cbbOrderSubmitModel.Items=0-allow the missing vote\r\n1-not allow the missing vote\r\n2-allow repeat selection
cbbOrderPromptMode.Items=0-without prompt\r\n1-only correct or wrong\r\n2-correct or wrong & answer

cbbNumberMode.Items=0-no rules with decimal point up to 8\r\n1-integer 1-100\r\n2-decimal
cbbNumberModifyModel.Items=0-not allow the modify\r\n1-allow the modify
cbbNumberSecrecyModel.Items=0-not keep secret\r\n1-keep secret
cbbNumberPromptMode.Items=0-without prompt\r\n1-only correct or wrong\r\n2-correct or wrong & answer

cbbClozeType.Items=0-character\r\n1-numeral
cbbClozeModifyModel.Items=0-not allow the modify\r\n1-allow the modify
cbbClozeSecrecyModel.Items=0-not keep secret\r\n1-keep secret
cbbClozePromptMode.Items=0-without prompt\r\n1-only correct or wrong\r\n2-correct or wrong & answer

cbbRushAnswerMode.Items=0-normal\r\n1-game

cbbAnalogModel.Items=0-report state\r\n1-key press simulation

cbbExamMode.Items=0-last upload results\r\n1-every question the results upload(not support)
cbbExamReportProgress.Items=0-no report\r\n1-report

cbbHWSubmitMode.Items=0-unspecified\r\n1-specified name\r\n2-specified number

cbbVoteMode.Items=0-three key vote\r\n1-two key vote\r\n2-title quick vote
cbbVoteSecrecyMode.Items=0-not keep secret\r\n1-keep secret
cbbVoteModifyMode.Items=0-not allow the modify\r\n1-allow the modify
cbbTitleVoteMode.Items=1-yes/no\r\n2-yes/no/abstain\r\n3-excellent/competent/incompetent\r\n4-excellent/competent/basic competent/incompetent\r\n5-excellent/good/average/poor\r\n6-grand prize/first prize/second prize/third prize\r\n7-very satisfactory/satisfied/neither/dissatisfied/very dissatisfied\r\n8-strongly agree/agree/uncertain/disagress/strongly disagree\r\n9-A/B/C/D\r\n10-A/B/C/D/E

cbbGradeMode.Items=0-custom comments\r\n1-excellent/competent/incompetent\r\n2-excellent/competent/basic competent/incompetent\r\n3-competent/incompetence/very incompetent\r\n4-satisfaction/basic satisfied/dissatisfied\r\n5-satisfied/dissatisfied/strongly dissatisfied\r\n6-excellent/good/average/poor\r\n7-grand prize/first prize/second prize/third prize/honorable prize\r\n10-digital level
cbbGradeModifyMode.Items=0-not allow the modify\r\n1-allow the modify
cbbGradeSecrecyMode.Items=0-not keep secret\r\n1-keep secret

cbbScoreMode.Items=0-0-no rules with decimal point up to 16\r\n1-integer 1-100\r\n2-decimal\r\n5-integer 0-255 limit.name and number\r\n6-Batch integer score 0-255 with limit and name
cbbScoreSecrecyMode.Items=0-not keep secret\r\n1-keep secret
cbbScoreModifyMode.Items=0-not allow the modify\r\n1-allow the modify
cbbScorePromptMode.Items=0-without prompt\r\n1-only correct or wrong\r\n2-correct or wrong & answer
cbbScoreLessMode.Items=0-yes\r\n1-no

cbbBatchVoteMode.Items=0-numbered\r\n1-random numbers
cbbBatchVoteSecrecyMode.Items=0-not keep secret\r\n1-keep secret
cbbBatchVoteLessMode.Items=0-enabled less\r\n1-disenabled less
cbbBatchVoteFixBallotMode.Items=0-not limit\r\n1-limit
cbbBatchVoteModifyMode.Items=0-not allow the modify\r\n1-allow the modify
cbbBatchVoteAvoidMode.Items=0-disenabled\r\n1-enabled

cbbBatchGradeMode.Items=0-numbered\r\n1-random numbers
cbbBatchGradeSecrecyMode.Items=0-not keep secret\r\n1-keep secret
cbbBatchGradeLessMode.Items=0-enabled less\r\n1-disenabled less
cbbBatchGradeFixBallotMode.Items=0-not limit\r\n1-limit
cbbBatchGradeModifyMode.Items=0-not allow the modify\r\n1-allow the modify
cbbBatchGradeAvoidMode.Items=0-disenabled\r\n1-enabled

cbbBatchScoreMode.Items=0-numbered\r\n1-random numbers
cbbBatchScoreSecrecyMode.Items=0-not keep secret\r\n1-keep secret
cbbBatchScoreLessMode.Items=0-enabled less\r\n1-disenabled less
cbbBatchScoreModifyMode.Items=0-not allow the modify\r\n1-allow the modify
cbbBatchScoreAvoidMode.Items=0-disenabled\r\n1-enabled

cbbMulAssessMode.Items=0-named (real name)\r\n1-number type (anonymous)
cbbMulAssessDisplayFormat.Items=0-Y axis is evaluating object X axis is indicator\r\n1-Y axis is indicator X axis is evaluating object\r\n2-Y axis is evaluating object and use some indicators\r\n3-Y axis is indicator and use some target
cbbMulAssessEnterMove.Items=0-still\r\n1-down automatically\r\n2-right automatically
cbbMulAssessLessMode.Items=0-enabled less\r\n1-disenabled less
cbbMulAssessSecrecyMode.Items=0-not keep secret\r\n1-keep secret
cbbMulAssessModifyMode.Items=0-not allow the modify\r\n1-allow the modify
cbbMulAssessAvoidMode.Items=0-disenabled\r\n1-enabled

cbbElectionUIMode.Items=0-check mode\r\n1-use for and against mode\r\n2-4 empty\r\n5-recommended mode1. Input name\r\n6-recommended mode2.Input name and remarks
cbbElectionMode.Items=0-all elections project operation\r\n1-specify the continuous election
cbbElectionOthersMode.Items=0-not allow\r\n1-allows(appoint) in the name list\r\n2-allow (input)
cbbElectionLessMode.Items=0-enabled less\r\n1-disenabled less
cbbElectionSecrecyMode.Items=0-not keep secret\r\n1-keep secret
cbbElectionModifyMode.Items=0-not allow the modify\r\n1-allow the modify

cbbRelayMode.Items=0-fixed\r\n1-random
cbbRelaySwitch.Items=0-off\r\n1-on
cbbRelayTransferMode.Items=0-allow automatic forwarding\r\n1-don't allow automatic forwarding
cbbRelayDestAddrMode.Items=0-1set + 10 target address\r\n1-1 address segment (the first address,ending address)\r\n2-forwarding all the keyboard data

cbbSelectLanguage.Items=Chinese(Simple)\r\nEnglish

cbbLampShowMode.Items=0-Default
cbbDeskTimeShowMode.Items=0-LED and LCD sync\r\n1-Only LED\r\n2-Only LCD
cbbDeskTimeShowFormat.Items=0-ss\r\n1-mm:ss
cbbDeskScoreMode.Items=0-Static\r\n1-Flash,1 seconds flash 3 times or so\r\n2-After flashing display static display,1 seconds flash 3 times or so\r\n3-Separate control lights,digital parameter is invalid,retain the original display
cbbDeskScoreShowMode.Items=0-LED and LCD sync\r\n1-Only the LED display, or before the screen display\r\n2-Only the LCD display, or after the screen display
cbbDeskScoreFlashLED.Items=0-Off\r\n1-On
cbbDeskScoreLED1.Items=0-Off\r\n1-On
cbbDeskScoreLED2.Items=0-Off\r\n1-On

[TGroupBox]
grpLoginSetDynamicID.Caption=Manual Numbers
grpLoginAuthorize.Caption=Manual authorized

[TMemo]
mmoMsg.Text=Zhang chairman of someone looking for outside
mmoEvaluationRuleExplain.Text=Achievements good/normal/bad\r\nBusiness ability good/normal/bad\r\nTechnical level good/normal/bad\r\nWorking attitude good/normal/bad
mmoScoreRuleExplain.Text=Achievements 0-25\r\nBusiness ability 0-25\r\nTechnical level 0-25\r\nWorking attitude 0-25



[Message]
CaptionMain=SunVote SDK Test Tool
CaptionDownload=Download the data
CaptionResponse=SunVote SDK Test Tool-Response data
CaptionAbout=About

;frmMain
MsgBaseKeyScopeError=Ending Keypad id number should be greater than the starting Keypad id number
MsgSignCodeError=Please fill the sign-in code for checking if the keypads' inputs are correct.
MsgSignModeError=Only when the sign-in mode is sign-in code, the background sign-in can be workable.
MsgBaseSoftDogError=The users' cusotmized message cannot be set as -1.
MsgKeyIDError=The changed Keypad id number cannot be 0
MsgBaseDemoOpen=The current is demo mode.
MsgBaseDemoClose=Demo mode is closed

MsgItemInfo=Item name
MsgRandomItem=Random number item name
MsgMultipleAssess=Multiple assess name
MsgEvaluationRule=Evaluation Rule
MsgScoreRule=Score Rule
MsgCharctor=Charctor
MsgSelfExercise=Self exercise

MsgFileDownload=File download
MsgAvoidItemsDownload=Avoid items

MsgItemNumError=The items number in file don't match the definition.
MsgReadFileError=Error in reading file
MsgFileNoDataError=There are no data or format to match in file. 
MsgSelFileError=Please select the correct collocate file.

;frmKeypadResponse
MsgObject=Object
MsgKeypad=Keypad
MsgSubmit=Submit
MsgItem=Item
MsgValue=Keypad value
MsgTime=Time
MsgAgree=Agree
MsgOppose=Oppose
MsgAbstain=Abstain
MsgTotal=Total


